jacenty22/STM32Simple/STM32F103RB/hardwareF1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LM35_IN_Pin GPIO_PIN_4
#define LM35_IN_GPIO_Port GPIOC
#define PHOTORESISTOR_IN_Pin GPIO_PIN_5
#define PHOTORESISTOR_IN_GPIO_Port GPIOC
#define THIRD_BUTTON_Pin GPIO_PIN_7
#define THIRD_BUTTON_GPIO_Port GPIOC
#define FIRST_BUTTON_Pin GPIO_PIN_8
#define FIRST_BUTTON_GPIO_Port GPIOA
#define SECOND_BUTTON_Pin GPIO_PIN_9
#define SECOND_BUTTON_GPIO_Port GPIOA
#define DS18b20_Pin GPIO_PIN_10
#define DS18b20_GPIO_Port GPIOA
#define DHT11_Pin GPIO_PIN_2
#define DHT11_GPIO_Port GPIOD
#define TRANSISTOR_BASE_Pin GPIO_PIN_5
#define TRANSISTOR_BASE_GPIO_Port GPIOB
#define LCD_SCL_Pin GPIO_PIN_6
#define LCD_SCL_GPIO_Port GPIOB
#define LCD_SDA_Pin GPIO_PIN_7
#define LCD_SDA_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
